coocox/Mplib/Toshaba/TMPM37x/TMPM372/cmsis_lib/lib/cmsis_boot/startup/coide/startup_coide.c
};

//*****************************************************************************
//
//! \brief This is the code that gets called when the processor first
//! starts execution following a reset event. 
//!
//! \param None.
//!
//! Only the absolutely necessary set is performed, after which the 
//! application supplied main() routine is called. 
//!
//! \return None.
//
//*****************************************************************************
void Default_ResetHandler(void)
{
    //
    // Initialize data and bss
    //
    unsigned long *pulSrc, *pulDest;

    //
    // Copy the data segment initializers from flash to SRAM
    //
    pulSrc = &_sidata;

    for(pulDest = &_sdata; pulDest < &_edata; )
    {
        *(pulDest++) = *(pulSrc++);
    }

    //
    // Zero fill the bss segment.
    //
    for(pulDest = &_sbss; pulDest < &_ebss; )
    {
        *(pulDest++) = 0;
    }

    //
    // Call the application's entry point.
    //
    SystemInit();
    main();
}

//*****************************************************************************
//
// Provide weak aliases for each Exception handler to the DefaultIntHandler. 
// As they are weak aliases, any function with the same name will override 
// this definition.
//
//*****************************************************************************  

#pragma weak ResetHandler         = Default_ResetHandler 
#pragma weak NMIIntHandler        = DefaultIntHandler 
#pragma weak HardFaultIntHandler  = DefaultIntHandler 
#pragma weak MemManageIntHandler  = DefaultIntHandler 
#pragma weak BusFaultIntHandler   = DefaultIntHandler 
#pragma weak UsageFaultIntHandler = DefaultIntHandler 
#pragma weak SVCIntHandler        = DefaultIntHandler 
#pragma weak DebugMonIntHandler   = DefaultIntHandler 
#pragma weak PendSVIntHandler     = DefaultIntHandler 
#pragma weak SysTickIntHandler    = DefaultIntHandler 

#pragma weak INT0_IRQHandler      = DefaultIntHandler 
#pragma weak INT1_IRQHandler      = DefaultIntHandler 
#pragma weak INT2_IRQHandler      = DefaultIntHandler 
#pragma weak INT3_IRQHandler      = DefaultIntHandler 
#pragma weak INT4_IRQHandler      = DefaultIntHandler 
#pragma weak INT5_IRQHandler      = DefaultIntHandler 
#pragma weak INTRX0_IRQHandler    = DefaultIntHandler 
#pragma weak INTTX0_IRQHandler    = DefaultIntHandler 
#pragma weak INTRX1_IRQHandler    = DefaultIntHandler 
#pragma weak INTTX1_IRQHandler    = DefaultIntHandler 
#pragma weak INTVCNA_IRQHandler   = DefaultIntHandler 
#pragma weak INTVCNB_IRQHandler   = DefaultIntHandler 
#pragma weak INTEMG0_IRQHandler   = DefaultIntHandler 
#pragma weak INTEMG1_IRQHandler   = DefaultIntHandler 
#pragma weak INTOVV0_IRQHandler   = DefaultIntHandler 
#pragma weak INTOVV1_IRQHandler   = DefaultIntHandler 
#pragma weak INTADAPDA_IRQHandler = DefaultIntHandler 
#pragma weak INTADBPDA_IRQHandler = DefaultIntHandler 
#pragma weak INTADAPDB_IRQHandler = DefaultIntHandler 
#pragma weak INTADBPDB_IRQHandler = DefaultIntHandler 
#pragma weak INTTB00_IRQHandler   = DefaultIntHandler 
#pragma weak INTTB01_IRQHandler   = DefaultIntHandler 
#pragma weak INTTB10_IRQHandler   = DefaultIntHandler 
#pragma weak INTTB11_IRQHandler   = DefaultIntHandler 
#pragma weak INTTB40_IRQHandler   = DefaultIntHandler 
#pragma weak INTTB41_IRQHandler   = DefaultIntHandler 
#pragma weak INTTB50_IRQHandler   = DefaultIntHandler 
#pragma weak INTTB51_IRQHandler   = DefaultIntHandler 
#pragma weak INTPMD0_IRQHandler   = DefaultIntHandler 
#pragma weak INTPMD1_IRQHandler   = DefaultIntHandler 
#pragma weak INTCAP00_IRQHandler  = DefaultIntHandler 
#pragma weak INTCAP01_IRQHandler  = DefaultIntHandler 
#pragma weak INTCAP10_IRQHandler  = DefaultIntHandler 
#pragma weak INTCAP11_IRQHandler  = DefaultIntHandler 
#pragma weak INTCAP40_IRQHandler  = DefaultIntHandler 
#pragma weak INTCAP41_IRQHandler  = DefaultIntHandler 
#pragma weak INTCAP50_IRQHandler  = DefaultIntHandler 
#pragma weak INTCAP51_IRQHandler  = DefaultIntHandler 
#pragma weak INT6_IRQHandler      = DefaultIntHandler 
#pragma weak INT7_IRQHandler      = DefaultIntHandler 
#pragma weak INTRX2_IRQHandler    = DefaultIntHandler 
#pragma weak INTTX2_IRQHandler    = DefaultIntHandler 
#pragma weak INTADACPA_IRQHandler = DefaultIntHandler 
#pragma weak INTADBCPA_IRQHandler = DefaultIntHandler 
#pragma weak INTADACPB_IRQHandler = DefaultIntHandler 
#pragma weak INTADBCPB_IRQHandler = DefaultIntHandler 
#pragma weak INTTB20_IRQHandler   = DefaultIntHandler 
#pragma weak INTTB21_IRQHandler   = DefaultIntHandler 
#pragma weak INTTB30_IRQHandler   = DefaultIntHandler 
#pragma weak INTTB31_IRQHandler   = DefaultIntHandler 
#pragma weak INTCAP20_IRQHandler  = DefaultIntHandler 
#pragma weak INTCAP21_IRQHandler  = DefaultIntHandler 
#pragma weak INTCAP30_IRQHandler  = DefaultIntHandler 
#pragma weak INTCAP31_IRQHandler  = DefaultIntHandler 
#pragma weak INTADASFT_IRQHandler = DefaultIntHandler 
#pragma weak INTADBSFT_IRQHandler = DefaultIntHandler 
#pragma weak INTADATMR_IRQHandler = DefaultIntHandler 
#pragma weak INTADBTMR_IRQHandler = DefaultIntHandler 
#pragma weak INT8_IRQHandler      = DefaultIntHandler 
#pragma weak INT9_IRQHandler      = DefaultIntHandler 
#pragma weak INTA_IRQHandler      = DefaultIntHandler 
#pragma weak INTB_IRQHandler      = DefaultIntHandler 
#pragma weak INTENC0_IRQHandler   = DefaultIntHandler 
#pragma weak INTENC1_IRQHandler   = DefaultIntHandler 
#pragma weak INTRX3_IRQHandler    = DefaultIntHandler 
#pragma weak INTTX3_IRQHandler    = DefaultIntHandler 
#pragma weak INTTB60_IRQHandler   = DefaultIntHandler 
#pragma weak INTTB61_IRQHandler   = DefaultIntHandler 
#pragma weak INTTB70_IRQHandler   = DefaultIntHandler 
#pragma weak INTTB71_IRQHandler   = DefaultIntHandler 
#pragma weak INTCAP60_IRQHandler  = DefaultIntHandler 
#pragma weak INTCAP61_IRQHandler  = DefaultIntHandler 
#pragma weak INTCAP70_IRQHandler  = DefaultIntHandler 
#pragma weak INTCAP71_IRQHandler  = DefaultIntHandler 
#pragma weak INTC_IRQHandler      = DefaultIntHandler 
#pragma weak INTD_IRQHandler      = DefaultIntHandler 
#pragma weak INTE_IRQHandler      = DefaultIntHandler 
#pragma weak INTF_IRQHandler      = DefaultIntHandler 

//*****************************************************************************
//
//! \brief This is the code that gets called when the processor receives an 
//! unexpected interrupt.  
//!
//! \param None.
//!
//! This simply enters an infinite loop, preserving the system state for 
//! examination by a debugger.
//!
//! \return None.  
//*****************************************************************************  
static void DefaultIntHandler(void) 
{
    //
    // Go into an infinite loop.
    //
    while (1) 
    {
    }
}

